MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA2E2A72DNJ/mcu.h
typedef struct                         /*!< (@ 0x407EC000) R_TSN Structure                                            */
{
    __IM uint16_t RESERVED[276];

    union
    {
        __IM uint16_t TSCDR;           /*!< (@ 0x00000228) Temperature Sensor Calibration Data Register               */

        struct
        {
            union
            {
                __IM uint8_t TSCDRL;         /*!< (@ 0x00000228) Temperature Sensor Calibration Data Register
                                              *                  L                                                          */

                struct
                {
                    __IM uint8_t TSCDRL : 8; /*!< [7..0] The calibration data stores the lower 8 bits of the convertedvalue. */
                } TSCDRL_b;
            };

            union
            {
                __IM uint8_t TSCDRH;         /*!< (@ 0x00000229) Temperature Sensor Calibration Data Register
                                              *                  H                                                          */

                struct
                {
                    __IM uint8_t TSCDRH : 8; /*!< [7..0] The calibration data stores the higher 8 bits of the
                                              *   convertedvalue.                                                           */
                } TSCDRH_b;
            };
        };
    };
    __IM uint16_t TSCDRR;              /*!< (@ 0x0000022A) Temperature Sensor Calibration Data Register
                                        *                  (Room Temperature)                                         */
} R_TSN_Type;                          /*!< Size = 556 (0x22c)                                                        */

/* =========================================================================================================================== */
/* ================                                           R_WDT                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief Watchdog Timer (R_WDT)
 */

typedef struct                         /*!< (@ 0x40044200) R_WDT Structure                                            */
{
    union
    {
        __IOM uint8_t WDTRR;           /*!< (@ 0x00000000) WDT Refresh Register                                       */

        struct
        {
            __IOM uint8_t WDTRR : 8;   /*!< [7..0] WDTRR is an 8-bit register that refreshes the down-counter
                                        *   of the WDT.                                                               */
        } WDTRR_b;
    };
    __IM uint8_t RESERVED;

    union
    {
        __IOM uint16_t WDTCR;          /*!< (@ 0x00000002) WDT Control Register                                       */

        struct
        {
            __IOM uint16_t TOPS : 2;   /*!< [1..0] Timeout Period Selection                                           */
            uint16_t            : 2;
            __IOM uint16_t CKS  : 4;   /*!< [7..4] Clock Division Ratio Selection                                     */
            __IOM uint16_t RPES : 2;   /*!< [9..8] Window End Position Selection                                      */
            uint16_t            : 2;
            __IOM uint16_t RPSS : 2;   /*!< [13..12] Window Start Position Selection                                  */
            uint16_t            : 2;
        } WDTCR_b;
    };

    union
    {
        __IOM uint16_t WDTSR;           /*!< (@ 0x00000004) WDT Status Register                                        */

        struct
        {
            __IM uint16_t  CNTVAL : 14; /*!< [13..0] Down-Counter Value                                                */
            __IOM uint16_t UNDFF  : 1;  /*!< [14..14] Underflow Flag                                                   */
            __IOM uint16_t REFEF  : 1;  /*!< [15..15] Refresh Error Flag                                               */
        } WDTSR_b;
    };

    union
    {
        __IOM uint8_t WDTRCR;          /*!< (@ 0x00000006) WDT Reset Control Register                                 */

        struct
        {
            uint8_t               : 7;
            __IOM uint8_t RSTIRQS : 1; /*!< [7..7] Reset Interrupt Request Selection                                  */
        } WDTRCR_b;
    };
    __IM uint8_t RESERVED1;

    union
    {
        __IOM uint8_t WDTCSTPR;        /*!< (@ 0x00000008) WDT Count Stop Control Register                            */

        struct
        {
            uint8_t              : 7;
            __IOM uint8_t SLCSTP : 1;  /*!< [7..7] Sleep-Mode Count Stop Control                                      */
        } WDTCSTPR_b;
    };
    __IM uint8_t  RESERVED2;
    __IM uint16_t RESERVED3;
} R_WDT_Type;                          /*!< Size = 12 (0xc)                                                           */

/* =========================================================================================================================== */
/* ================                                           R_AES                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief AES Engine (R_AES)
 */

typedef struct                         /*!< (@ 0x400D0000) R_AES Structure                                            */
{
    union
    {
        __IOM uint16_t AESMOD;         /*!< (@ 0x00000000) AES Mode Register                                          */

        struct
        {
            __IOM uint16_t MODEN  : 1; /*!< [0..0] Read Request Enable                                                */
            uint16_t              : 7;
            __IOM uint16_t RDRQEN : 1; /*!< [8..8] Read Request Enable                                                */
            __IOM uint16_t WRRQEN : 1; /*!< [9..9] Write Request Enable                                               */
            uint16_t              : 6;
        } AESMOD_b;
    };
    __IM uint16_t RESERVED;

    union
    {
        __IOM uint32_t AESCMD;           /*!< (@ 0x00000004) AES Command Register                                       */

        struct
        {
            __IOM uint32_t INVCIP   : 1; /*!< [0..0] Select data encryption/decryption                                  */
            __IOM uint32_t KEYLN    : 1; /*!< [1..1] Select the Key Length                                              */
            uint32_t                : 2;
            __IOM uint32_t CHAIN    : 2; /*!< [5..4] Select the chaining mode                                           */
            uint32_t                : 2;
            __IOM uint32_t STORESEL : 2; /*!< [9..8] Read Request Enable                                                */
            uint32_t                : 2;
            __IOM uint32_t KEYSEL   : 1; /*!< [12..12] Select the Key Register                                          */
            uint32_t                : 11;
            __IM uint32_t DWRDY     : 1; /*!< [24..24] This bit indicates that AESDW is ready to write or
                                          *   is writing                                                                */
            __IM uint32_t DRRDY : 1;     /*!< [25..25] This bit indicates that AESDW is ready to read or is
                                          *   reading                                                                   */
            __IM uint32_t CWRDY : 1;     /*!< [26..26] This bit indicates that AESCMD is ready to write                 */
            __IM uint32_t IWRDY : 1;     /*!< [27..27] This bit indicates that AESIVW is ready to write or
                                          *   is writing                                                                */
            __IM uint32_t IRRDY : 1;     /*!< [28..28] This bit indicates that AESIVW is ready to read or
                                          *   is reading                                                                */
            __IM uint32_t KWRDY0 : 1;    /*!< [29..29] This bit indicates that AESKW0 is ready to write or
                                          *   is writing                                                                */
            __IM uint32_t KWRDY1 : 1;    /*!< [30..30] This bit indicates that AESKW1 is ready to write or
                                          *   is writing                                                                */
            __IM uint32_t ILOP : 1;      /*!< [31..31] This bit shows that the relation of Key Register 0
                                          *   and Key Register1 is not correct (for 256-bit key-length)                 */
        } AESCMD_b;
    };
    __IOM uint32_t AESDW;                /*!< (@ 0x00000008) AES Data Window Register                                   */
    __IOM uint32_t AESIVW;               /*!< (@ 0x0000000C) AES IV Window Register                                     */
    __IOM uint32_t AESKW0;               /*!< (@ 0x00000010) AES Key Window 0 Register                                  */
    __IOM uint32_t AESKW1;               /*!< (@ 0x00000014) AES Key Window 1 Register                                  */
} R_AES_Type;                            /*!< Size = 24 (0x18)                                                          */

/* =========================================================================================================================== */
/* ================                                          R_AGTX0                                          ================ */
/* =========================================================================================================================== */

/**
 * @brief Asynchronous General Purpose Timer (R_AGTX0)
 */

typedef struct                          /*!< (@ 0x40084000) R_AGTX0 Structure                                          */
{
    union
    {
        __IOM R_AGTX0_AGT32_Type AGT32; /*!< (@ 0x00000000) AGTW (32-bit) peripheral registers                         */
        __IOM R_AGTX0_AGT16_Type AGT16; /*!< (@ 0x00000000) AGT (16-bit) peripheral registers                          */
    };
} R_AGTX0_Type;                         /*!< Size = 20 (0x14)                                                          */

